{
  "techniques": [
    {
      "id": 1,
      "title": "Traffic Lights",
      "description": "Students show red/yellow/green cards to indicate understanding or confidence level",
      "examples": [
        "During basketball dribbling practice, students hold up green (confident with weak hand), yellow (need more practice), or red (struggling with technique)",
        "In gymnastics, after learning a new balance, students show their card to indicate if they can hold it for 5 seconds (green), 3 seconds (yellow), or less than 3 seconds (red)",
        "During fitness testing, students use traffic lights to show if they met their target heart rate zone (green), came close (yellow), or missed it (red)"
      ]
    },
    {
      "id": 2,
      "title": "Two Stars and a Wish",
      "description": "Feedback format: two things done well, one area for improvement",
      "examples": [
        "After watching a gymnastics routine: 'Your landing was stable and your arms were straight. I wish you'd point your toes throughout.'",
        "Observing a tennis serve: 'Your ball toss was consistent and you had great follow-through. I wish you'd bend your knees more for extra power.'",
        "Watching a swimming stroke: 'Your breathing timing was perfect and your kicks were strong. I wish you'd extend your arm further on the reach.'"
      ]
    },
    {
      "id": 3,
      "title": "Think-Pair-Share",
      "description": "Students think individually, discuss with partner, then share with class",
      "examples": [
        "'Think about what makes a good chest pass. Discuss with your partner. Now share with the class.'",
        "'Think about which muscles you're using during a plank. Turn to your partner and compare ideas. Who wants to share what you discussed?'",
        "'Consider the best strategy for your team in capture the flag. Discuss with your partner for 2 minutes. Now let's hear some ideas.'"
      ]
    },
    {
      "id": 4,
      "title": "Pose-Pause-Pounce-Bounce",
      "description": "Ask question, pause, select student (pounce), bounce response to another student",
      "examples": [
        "'What should your knees do during a squat?' [pause 5 seconds] 'Jamie?' [Jamie answers] 'Do you agree, Marcus?'",
        "'Why do we warm up before exercise?' [pause] 'Chen?' [Chen responds] 'Can you add to that, Sofia?'",
        "'What's the purpose of follow-through in throwing?' [pause] 'Aisha?' [Aisha explains] 'Does everyone agree? Thoughts, David?'"
      ]
    },
    {
      "id": 5,
      "title": "Mini Whiteboards",
      "description": "Students write responses on small whiteboards for instant whole-class assessment",
      "examples": [
        "'Draw the flight path of a shuttlecock during a clear shot in badminton'",
        "'Sketch the proper foot position for a basketball free throw and label the key points'",
        "'Write down three muscles used in a push-up and hold up your boards'"
      ]
    },
    {
      "id": 6,
      "title": "Exit Passes",
      "description": "Quick assessment as students leave",
      "examples": [
        "Before leaving: 'Demonstrate one proper volleyball serve or write down the three key points'",
        "'On your exit card, draw one stretch we learned today and write which muscle group it targets'",
        "'Show me your best defensive stance in basketball before you leave the gym'"
      ]
    },
    {
      "id": 7,
      "title": "Peer Improvement of Homework",
      "description": "Students give each other feedback on practice/skills",
      "examples": [
        "Students film their soccer skills at home, then give each other coaching feedback in class",
        "Partners review each other's fitness logs and suggest one improvement to their training routine",
        "Students watch each other's recorded dance sequences and provide two stars and a wish feedback"
      ]
    },
    {
      "id": 8,
      "title": "Colored Cups",
      "description": "Red/yellow/green cups on stations to signal if group needs help",
      "examples": [
        "At fitness stations: green cup means 'we've got this,' yellow means 'questions but working,' red means 'need teacher help now'",
        "During small-group skill practice in badminton: groups display cup to show their progress level",
        "In circuit training: each station has cups so teacher can see where to provide support without interrupting flow"
      ]
    },
    {
      "id": 9,
      "title": "ABCD Corners",
      "description": "Students move to room corners labeled A, B, C, D based on their answer",
      "examples": [
        "'Which is most important in netball shooting? A-elbow position B-follow through C-knee bend D-focus point. Go to your corner!'",
        "'What's the primary benefit of interval training? A-strength B-endurance C-flexibility D-power. Move to your answer!'",
        "'Which phase of a sprint is most important? A-start B-acceleration C-max speed D-finish. Choose your corner!'"
      ]
    },
    {
      "id": 10,
      "title": "No Hands Up",
      "description": "Teacher selects students rather than volunteers (cold calling)",
      "examples": [
        "'I'm going to select someone to demonstrate a forward roll. Get ready... Aisha, please show us.'",
        "'I need someone to explain the triple jump technique. Let me see... Marcus, talk us through it.'",
        "'Who can demonstrate proper baton passing? Everyone ready... Jamie, come show us.'"
      ]
    },
    {
      "id": 11,
      "title": "Hot-Seat Questioning",
      "description": "Intense questioning of one student while others observe",
      "examples": [
        "After a dance performance: intensively question one dancer about their movement choices, timing, and spatial awareness",
        "Put a student in the hot seat after their penalty kick: 'Where were you looking? How did you decide direction? What was your approach strategy?'",
        "Question a student about their fitness plan: 'Why this exercise? How many reps? What's the target heart rate? Which muscle groups?'"
      ]
    },
    {
      "id": 12,
      "title": "Student Reporter",
      "description": "One student reports back on group's progress or understanding",
      "examples": [
        "After small-sided soccer games: 'Maya, report back on your team's defensive strategy'",
        "'Carlos, tell us what your group discovered about effective teamwork in ultimate frisbee'",
        "'Sophie, share your group's findings about which warm-up exercises raised heart rate most effectively'"
      ]
    },
    {
      "id": 13,
      "title": "Three Best Samples Discussion",
      "description": "Compare three demonstrations to identify quality criteria",
      "examples": [
        "Show three students performing tennis serves, discuss which technique elements are strongest in each",
        "Watch three different approaches to the high jump and analyze what makes each effective",
        "Compare three students' layups and identify the best elements of footwork, ball control, and finish"
      ]
    },
    {
      "id": 14,
      "title": "Real-Time Test",
      "description": "Quick skill checks during activity",
      "examples": [
        "Walk around during basketball practice with clipboard, quickly checking each student's pivot foot technique",
        "During swimming laps, assess each student's breathing technique and note on checklist",
        "In cricket practice, quickly observe and record each student's bowling action for one specific criterion"
      ]
    },
    {
      "id": 15,
      "title": "Best Examples Discussion",
      "description": "Analyze excellent demonstrations to identify success criteria",
      "examples": [
        "'Watch these three forward rolls. What makes them high quality? What criteria should we use?'",
        "'Look at these excellent football passes. What do they all have in common? Let's create our success criteria.'",
        "'Here are three great badminton serves. What elements make them successful? Let's list the key features.'"
      ]
    },
    {
      "id": 16,
      "title": "Ask the Audience",
      "description": "Student asks classmates for help when stuck",
      "examples": [
        "Student struggling with handstand: 'Who can give Sarah a tip about hand placement?'",
        "'David's having trouble with his javelin grip. Can someone who's got it help him out?'",
        "'Emma needs advice on her butterfly stroke breathing. Audience, what suggestions do you have?'"
      ]
    },
    {
      "id": 17,
      "title": "Phone a Friend",
      "description": "Student can consult a peer before answering",
      "examples": [
        "'You have 30 seconds to consult someone about how to improve your triple jump approach before I assess you'",
        "'Need help with the rules? You can phone a friend for 15 seconds before you answer'",
        "'Stuck on the correct grip? Phone a friend quickly and then show me your best attempt'"
      ]
    },
    {
      "id": 18,
      "title": "If You've Learned It, Help Someone Who Hasn't",
      "description": "Peer teaching during practice",
      "examples": [
        "'If you can do three consecutive keepie-uppies, find someone who can't and coach them'",
        "'Once you've mastered the egg beater kick in water polo, partner with someone still learning it'",
        "'Got the proper squat form? Great! Help two other people who are still working on it'"
      ]
    },
    {
      "id": 19,
      "title": "Strengths and Weaknesses Discussion",
      "description": "Analyze performance for both positives and areas to improve",
      "examples": [
        "Watch video of class relay race: 'What did we do well? What caused us to drop the baton?'",
        "After dodgeball game: 'What were our team's strengths? Where did we struggle? Let's discuss both.'",
        "Review footage of gymnastics routine: 'Identify three strong elements and two areas for improvement'"
      ]
    },
    {
      "id": 20,
      "title": "Student Engagement Techniques",
      "description": "Strategies to keep all students actively participating",
      "examples": [
        "Use 'last person to touch the ball must shoot' in basketball to ensure all players handle the ball",
        "In volleyball: 'Every team member must touch the ball before you can return it over the net'",
        "Tag rugby rule: 'You must pass to at least three different players before scoring a try'"
      ]
    },
    {
      "id": 21,
      "title": "Go Fifty-Fifty",
      "description": "Split class by opinion/response for discussion",
      "examples": [
        "'Stand on this line if you think defense is most important in ultimate frisbee, this line if you think offense is'",
        "'Move to the left if you believe interval training is better, right if you prefer steady-state cardio'",
        "'North wall if power is more important in tennis, south wall if placement matters more'"
      ]
    },
    {
      "id": 22,
      "title": "Popsicle Sticks",
      "description": "Random selection using names on sticks",
      "examples": [
        "Pull sticks to randomly select who demonstrates the next swimming stroke",
        "Use sticks to choose team captains fairly for small-sided games",
        "Draw a stick to determine who explains the next drill to the class"
      ]
    },
    {
      "id": 23,
      "title": "Reporter at Random",
      "description": "Randomly select group reporter after discussion",
      "examples": [
        "After group fitness circuit design: randomly select one member from each group to explain their circuit",
        "'Each group design a warm-up. I'll randomly pick someone to present it, so everyone be ready.'",
        "After tactical discussion in hockey: 'I'll pick one person randomly to share your team's strategy'"
      ]
    },
    {
      "id": 24,
      "title": "Red or Green Disks",
      "description": "Simple binary response system (ready/not ready, agree/disagree)",
      "examples": [
        "During track practice, flip to green when you've completed your lap at target pace, red if you missed it",
        "'Show green if you're ready for assessment, red if you need more practice time'",
        "'Green disk if you agree with that coaching point, red if you have questions'"
      ]
    },
    {
      "id": 25,
      "title": "ABCD Cards",
      "description": "Students hold up A, B, C, or D cards to answer multiple choice",
      "examples": [
        "'Hold up your answer: Which muscle group do push-ups primarily work? A-legs B-back C-chest D-core'",
        "'Show your card: What's the first thing to do when injured? A-ice B-stretch C-continue D-rest'",
        "'Cards up: Which skill is most important in badminton? A-power B-placement C-speed D-deception'"
      ]
    },
    {
      "id": 26,
      "title": "Wait Time",
      "description": "Pause after asking questions to allow thinking time",
      "examples": [
        "Ask 'What's the key to a good spike in volleyball?' then count to 5 silently before accepting answers",
        "'What makes an effective warm-up?' [pause for 5 seconds] 'Now, who has an idea?'",
        "'Think about proper breathing during running' [wait 5 seconds] 'Okay, share your thoughts'"
      ]
    },
    {
      "id": 27,
      "title": "Extended Wait Time",
      "description": "Longer pauses (10+ seconds) for complex questions",
      "examples": [
        "'How would you design a warm-up for a marathon runner?' [wait 15 seconds for thinking time]",
        "'What's the best strategy for a team losing by 2 goals with 10 minutes left?' [pause 12 seconds]",
        "'How does altitude affect athletic performance?' [wait 15 seconds before taking responses]"
      ]
    },
    {
      "id": 28,
      "title": "If You Did Know, What Would You Say?",
      "description": "Encourages students to attempt answers",
      "examples": [
        "'You're not sure? OK, if you *did* know what makes a good penalty kick, what might you say?'",
        "'Not certain? Imagine you did know the answer about sprint starting technique - what would it be?'",
        "'Take a guess - if you knew why we cool down after exercise, what would your answer be?'"
      ]
    },
    {
      "id": 29,
      "title": "If You Don't Know, I'll Come Back to You",
      "description": "Reduces anxiety, allows processing time",
      "examples": [
        "'Not ready yet, Marcus? That's fine, keep thinking and I'll check back in 2 minutes'",
        "'Need more time? No problem, I'll ask someone else and circle back to you'",
        "'Still processing? That's okay, keep thinking about it while I check with others'"
      ]
    },
    {
      "id": 30,
      "title": "Evaluative and Interpretive Listening",
      "description": "Students listen to judge quality or meaning in demonstrations",
      "examples": [
        "'Listen to your partner's breathing during their run. What does it tell you about their pace?'",
        "'Listen to the sound of the basketball hitting the court. What does a good dribble sound like?'",
        "'Listen to the rhythm of your partner's swimming stroke. Is it smooth and consistent?'"
      ]
    },
    {
      "id": 31,
      "title": "Hinge-Point Questions",
      "description": "Key questions that determine if class can move forward",
      "examples": [
        "Before progressing to game play: 'Show me your ready position in tennis' - if most can't, reteach before moving on",
        "'Can everyone demonstrate proper landing technique?' - must see this before teaching more complex jumps",
        "'Show me the grip for a forehand' - essential check before moving to rallying"
      ]
    },
    {
      "id": 32,
      "title": "What Did We Learn Today?",
      "description": "Quick reflection at lesson end",
      "examples": [
        "Final huddle: 'Tell your partner one thing you learned about dodging in netball today'",
        "'Before you go, write one new skill you practiced today on the exit board'",
        "'Gather round - who can share one thing they'll remember from today's lesson?'"
      ]
    },
    {
      "id": 33,
      "title": "Best Accent Competition",
      "description": "Fun way to practice verbal feedback (adaptable to PE contexts)",
      "examples": [
        "'Give your coaching feedback in your best sports commentator voice' (makes feedback fun and memorable)",
        "'Describe the play like you're a football commentator at the World Cup final'",
        "'Explain the technique like you're a legendary coach giving a motivational speech'"
      ]
    },
    {
      "id": 34,
      "title": "Find the Errors and Fix Them",
      "description": "Identify and correct mistakes in technique demonstrations",
      "examples": [
        "Show video of deliberately flawed gymnastics routine: 'Spot the 5 technique errors and suggest corrections'",
        "'Watch my intentionally incorrect tennis serve. What's wrong and how should I fix it?'",
        "'I'm going to perform a plank with three mistakes. Find them and tell me the correct form.'"
      ]
    },
    {
      "id": 35,
      "title": "Error Classification",
      "description": "Categorize common mistakes to understand patterns",
      "examples": [
        "After batting practice: 'Let's categorize your misses - were they timing, eye on ball, or stance issues?'",
        "'Look at these failed basketball shots. Are they distance, direction, or arc problems?'",
        "'Review your gymnastics attempts. Are errors due to balance, strength, or technique understanding?'"
      ]
    },
    {
      "id": 36,
      "title": "Ranking Exemplars",
      "description": "Put demonstrations in order from weakest to strongest",
      "examples": [
        "Show 4 videos of layups: 'Put these in order from best to worst technique and explain your ranking'",
        "'Watch these five swimming turns. Rank them 1-5 and justify your choices'",
        "'Here are four different volleyball serves. Order them by effectiveness and explain why'"
      ]
    },
    {
      "id": 37,
      "title": "C3B4ME",
      "description": "'See 3 Before Me' - ask 3 peers before asking teacher",
      "examples": [
        "'Before asking me about your badminton grip, check with 3 classmates first'",
        "'Stuck on the dance sequence? Consult three peers before coming to me'",
        "'Need help with your fitness plan? Get input from three other students first'"
      ]
    },
    {
      "id": 38,
      "title": "Homework Help Board",
      "description": "Space where students post questions (adaptable for skill practice)",
      "examples": [
        "Whiteboard where students post: 'Can someone explain the offside rule?' with space for peer responses",
        "'Post your training questions on the board. Others can write answers before next class.'",
        "'Write your technique questions here. Classmates who know the answer can respond.'"
      ]
    },
    {
      "id": 39,
      "title": "Preflight Checklist",
      "description": "Students check criteria before attempting skill",
      "examples": [
        "Before attempting a javelin throw, check: feet position, grip, shoulder back, eyes on target, release point",
        "'Before diving, run through: approach steps, arm position, head placement, body alignment'",
        "'Gymnastics routine checklist: starting position, sequence order, timing, finishing pose'"
      ]
    },
    {
      "id": 40,
      "title": "I-You-We Checklist",
      "description": "Scaffold from teacher demo to peer work to independent practice",
      "examples": [
        "Swimming: 'I demonstrated freestyle breathing. You practiced with your partner. Now we'll all swim independently.'",
        "'I showed the volleyball serve. You tried it with feedback from a partner. Now we practice on our own.'",
        "'I modeled the defensive stance. You worked with a partner to practice. Now everyone apply it in the game.'"
      ]
    }
  ],
  "favorites": {},
  "date": "2025-01-01T00:00:00.000Z"
}
